{"format": "layers-model",
 "generatedBy": "keras v2.5.0",
 "convertedBy": "TensorFlow.js Converter v3.9.0",
 "modelTopology": {"keras_version": "2.5.0",
 "backend": "tensorflow",
 "model_config": {"class_name": "Sequential",
 "config": {"name": "sequential_8",
 "layers": [{"class_name": "InputLayer",
 "config": {"batch_input_shape": [null,
 42],
 "dtype": "float32",
 "sparse": false,
 "ragged": false,
 "name": "input_9"}},
 {"class_name": "Dropout",
 "config": {"name": "dropout_16",
 "trainable": true,
 "dtype": "float32",
 "rate": 0.2,
 "noise_shape": null,
 "seed": null}},
 {"class_name": "Dense",
 "config": {"name": "dense_24",
 "trainable": true,
 "dtype": "float32",
 "units": 20,
 "activation": "relu",
 "use_bias": true,
 "kernel_initializer": {"class_name": "GlorotUniform",
 "config": {"seed": null}},
 "bias_initializer": {"class_name": "Zeros",
 "config": {}},
 "kernel_regularizer": null,
 "bias_regularizer": null,
 "activity_regularizer": null,
 "kernel_constraint": null,
 "bias_constraint": null}},
 {"class_name": "Dropout",
 "config": {"name": "dropout_17",
 "trainable": true,
 "dtype": "float32",
 "rate": 0.4,
 "noise_shape": null,
 "seed": null}},
 {"class_name": "Dense",
 "config": {"name": "dense_25",
 "trainable": true,
 "dtype": "float32",
 "units": 10,
 "activation": "relu",
 "use_bias": true,
 "kernel_initializer": {"class_name": "GlorotUniform",
 "config": {"seed": null}},
 "bias_initializer": {"class_name": "Zeros",
 "config": {}},
 "kernel_regularizer": null,
 "bias_regularizer": null,
 "activity_regularizer": null,
 "kernel_constraint": null,
 "bias_constraint": null}},
 {"class_name": "Dense",
 "config": {"name": "dense_26",
 "trainable": true,
 "dtype": "float32",
 "units": 6,
 "activation": "softmax",
 "use_bias": true,
 "kernel_initializer": {"class_name": "GlorotUniform",
 "config": {"seed": null}},
 "bias_initializer": {"class_name": "Zeros",
 "config": {}},
 "kernel_regularizer": null,
 "bias_regularizer": null,
 "activity_regularizer": null,
 "kernel_constraint": null,
 "bias_constraint": null}}]}}},
 "weightsManifest": [{"paths": ["group1-shard1of1.bin"],
 "weights": [{"name": "dense_24/kernel",
 "shape": [42,
 20],
 "dtype": "float32"},
 {"name": "dense_24/bias",
 "shape": [20],
 "dtype": "float32"},
 {"name": "dense_25/kernel",
 "shape": [20,
 10],
 "dtype": "float32"},
 {"name": "dense_25/bias",
 "shape": [10],
 "dtype": "float32"},
 {"name": "dense_26/kernel",
 "shape": [10,
 6],
 "dtype": "float32"},
 {"name": "dense_26/bias",
 "shape": [6],
 "dtype": "float32"}]}]}