{"format": "layers-model",
 "generatedBy": "keras v2.5.0",
 "convertedBy": "TensorFlow.js Converter v3.9.0",
 "modelTopology": {"keras_version": "2.5.0",
 "backend": "tensorflow",
 "model_config": {"class_name": "Sequential",
 "config": {"name": "sequential_1",
 "layers": [{"class_name": "InputLayer",
 "config": {"batch_input_shape": [null,
 64],
 "dtype": "float32",
 "sparse": false,
 "ragged": false,
 "name": "input_2"}},
 {"class_name": "Reshape",
 "config": {"name": "reshape_1",
 "trainable": true,
 "batch_input_shape": [null,
 64],
 "dtype": "float32",
 "target_shape": [16,
 4]}},
 {"class_name": "Dropout",
 "config": {"name": "dropout_2",
 "trainable": true,
 "dtype": "float32",
 "rate": 0.2,
 "noise_shape": null,
 "seed": null}},
 {"class_name": "LSTM",
 "config": {"name": "lstm_1",
 "trainable": true,
 "batch_input_shape": [null,
 16,
 4],
 "dtype": "float32",
 "return_sequences": false,
 "return_state": false,
 "go_backwards": false,
 "stateful": false,
 "unroll": false,
 "time_major": false,
 "units": 16,
 "activation": "tanh",
 "recurrent_activation": "sigmoid",
 "use_bias": true,
 "kernel_initializer": {"class_name": "GlorotUniform",
 "config": {"seed": null}},
 "recurrent_initializer": {"class_name": "Orthogonal",
 "config": {"gain": 1.0,
 "seed": null}},
 "bias_initializer": {"class_name": "Zeros",
 "config": {}},
 "unit_forget_bias": true,
 "kernel_regularizer": null,
 "recurrent_regularizer": null,
 "bias_regularizer": null,
 "activity_regularizer": null,
 "kernel_constraint": null,
 "recurrent_constraint": null,
 "bias_constraint": null,
 "dropout": 0.0,
 "recurrent_dropout": 0.0,
 "implementation": 2}},
 {"class_name": "Dropout",
 "config": {"name": "dropout_3",
 "trainable": true,
 "dtype": "float32",
 "rate": 0.5,
 "noise_shape": null,
 "seed": null}},
 {"class_name": "Dense",
 "config": {"name": "dense_2",
 "trainable": true,
 "dtype": "float32",
 "units": 10,
 "activation": "relu",
 "use_bias": true,
 "kernel_initializer": {"class_name": "GlorotUniform",
 "config": {"seed": null}},
 "bias_initializer": {"class_name": "Zeros",
 "config": {}},
 "kernel_regularizer": null,
 "bias_regularizer": null,
 "activity_regularizer": null,
 "kernel_constraint": null,
 "bias_constraint": null}},
 {"class_name": "Dense",
 "config": {"name": "dense_3",
 "trainable": true,
 "dtype": "float32",
 "units": 5,
 "activation": "softmax",
 "use_bias": true,
 "kernel_initializer": {"class_name": "GlorotUniform",
 "config": {"seed": null}},
 "bias_initializer": {"class_name": "Zeros",
 "config": {}},
 "kernel_regularizer": null,
 "bias_regularizer": null,
 "activity_regularizer": null,
 "kernel_constraint": null,
 "bias_constraint": null}}]}}},
 "weightsManifest": [{"paths": ["group1-shard1of1.bin"],
 "weights": [{"name": "dense_2/kernel",
 "shape": [16,
 10],
 "dtype": "float32"},
 {"name": "dense_2/bias",
 "shape": [10],
 "dtype": "float32"},
 {"name": "dense_3/kernel",
 "shape": [10,
 5],
 "dtype": "float32"},
 {"name": "dense_3/bias",
 "shape": [5],
 "dtype": "float32"},
 {"name": "lstm_1/lstm_cell_4/kernel",
 "shape": [4,
 64],
 "dtype": "float32"},
 {"name": "lstm_1/lstm_cell_4/recurrent_kernel",
 "shape": [16,
 64],
 "dtype": "float32"},
 {"name": "lstm_1/lstm_cell_4/bias",
 "shape": [64],
 "dtype": "float32"}]}]}