{"format": "layers-model",
 "generatedBy": "keras v2.5.0",

 "convertedBy": "TensorFlow.js Converter v3.9.0",
 "modelTopology": {"keras_version": "2.5.0",
 "backend": "tensorflow",
 "model_config": {"class_name": "Sequential",
 "config": {"name": "sequential_2",
 "layers": [{"class_name": "InputLayer",
 "config": {"batch_input_shape": [null,
 64],
 "dtype": "float32",
 "sparse": false,
 "ragged": false,
 "name": "input_3"}},
 {"class_name": "Dropout",
 "config": {"name": "dropout_4",
 "trainable": true,
 "dtype": "float32",
 "rate": 0.2,
 "noise_shape": null,
 "seed": null}},
 {"class_name": "Dense",
 "config": {"name": "dense_5",
 "trainable": true,
 "dtype": "float32",
 "units": 24,
 "activation": "relu",
 "use_bias": true,
 "kernel_initializer": {"class_name": "GlorotUniform",
 "config": {"seed": null}},
 "bias_initializer": {"class_name": "Zeros",
 "config": {}},
 "kernel_regularizer": null,
 "bias_regularizer": null,
 "activity_regularizer": null,
 "kernel_constraint": null,
 "bias_constraint": null}},
 {"class_name": "Dropout",
 "config": {"name": "dropout_5",
 "trainable": true,
 "dtype": "float32",
 "rate": 0.5,
 "noise_shape": null,
 "seed": null}},
 {"class_name": "Dense",
 "config": {"name": "dense_6",
 "trainable": true,
 "dtype": "float32",
 "units": 10,
 "activation": "relu",
 "use_bias": true,
 "kernel_initializer": {"class_name": "GlorotUniform",
 "config": {"seed": null}},
 "bias_initializer": {"class_name": "Zeros",
 "config": {}},
 "kernel_regularizer": null,
 "bias_regularizer": null,
 "activity_regularizer": null,
 "kernel_constraint": null,
 "bias_constraint": null}},
 {"class_name": "Dense",
 "config": {"name": "dense_7",
 "trainable": true,
 "dtype": "float32",
 "units": 5,
 "activation": "softmax",
 "use_bias": true,
 "kernel_initializer": {"class_name": "GlorotUniform",
 "config": {"seed": null}},
 "bias_initializer": {"class_name": "Zeros",
 "config": {}},
 "kernel_regularizer": null,
 "bias_regularizer": null,
 "activity_regularizer": null,
 "kernel_constraint": null,
 "bias_constraint": null}}]}}},
 "weightsManifest": [{"paths": ["group1-shard1of1_point.bin"],
 "weights": [{"name": "dense_5/kernel",
 "shape": [64,
 24],
 "dtype": "float32"},
 {"name": "dense_5/bias",
 "shape": [24],
 "dtype": "float32"},
 {"name": "dense_6/kernel",
 "shape": [24,
 10],
 "dtype": "float32"},
 {"name": "dense_6/bias",
 "shape": [10],
 "dtype": "float32"},
 {"name": "dense_7/kernel",
 "shape": [10,
 5],
 "dtype": "float32"},
 {"name": "dense_7/bias",
 "shape": [5],
 "dtype": "float32"}]}]}